In [2]:
# Alistair Empey - CIDAF Final Project

In [24]:
import pandas as pd
from datetime import date, timedelta
import seaborn as sns
import matplotlib.pyplot as plt
import os

In [5]:
today = date.today()
d1 = today.strftime('%Y-%m-%d')
end_date = d1

d2 = date.today() - timedelta(days=365)
d2 = d2.strftime('%Y-%m-%d')
start_date = d2

In [25]:
os.getcwd()

'/Users/aliempey/Desktop/CIDAF'

In [34]:
eurusd = pd.read_csv('/Users/aliempey/Desktop/CIDAF/EURUSD.csv')

In [35]:
eurusd.head()

         Date      Open      High       Low     Close  Adj Close  Volume
0  2021-09-10  1.182355  1.185300  1.181935  1.182592   1.182592       0
1  2021-09-13  1.181251  1.181754  1.177060  1.181195   1.181195       0
2  2021-09-14  1.181070  1.184699  1.180200  1.181195   1.181195       0
3  2021-09-15  1.180359  1.183300  1.180100  1.180498   1.180498       0
4  2021-09-16  1.181935  1.182313  1.175171  1.182000   1.182000       0

In [37]:
eurusd.set_index('Date').head(2)

                Open      High       Low     Close  Adj Close  Volume
Date
2021-09-10  1.182355  1.185300  1.181935  1.182592   1.182592       0
2021-09-13  1.181251  1.181754  1.177060  1.181195   1.181195       0

In [52]:
oil = pd.read_excel('https://www.eia.gov/dnav/pet/xls/PET_PRI_SPT_S1_D.xls', sheet_name='Data 1', skiprows=[1, 2])

In [53]:
oil.head()

  Back to Contents  Data 1: Crude Oil  Unnamed: 2
0       1986-01-02              25.56         NaN
1       1986-01-03              26.00         NaN
2       1986-01-06              26.53         NaN
3       1986-01-07              25.85         NaN
4       1986-01-08              25.87         NaN

In [54]:
oil. rename(columns = {'Back to Contents':'Date', 'Data 1: Crude Oil':'Close'}, inplace = True)

In [55]:
oil.head()

        Date  Close  Unnamed: 2
0 1986-01-02  25.56         NaN
1 1986-01-03  26.00         NaN
2 1986-01-06  26.53         NaN
3 1986-01-07  25.85         NaN
4 1986-01-08  25.87         NaN

In [56]:
oil=oil.iloc[:,0:2]

In [57]:
oil.head()

        Date  Close
0 1986-01-02  25.56
1 1986-01-03  26.00
2 1986-01-06  26.53
3 1986-01-07  25.85
4 1986-01-08  25.87